import { defineStore } from 'pinia'

export const useHomeStore = defineStore('home', {
    state: () => ({
            welcomeMessage: 'តេជោសិទ្ធារាមមហាសង្រានបាន្លួង',
            helperMessage: 'សួស្តីឆ្នាំថ្មីខ្មែរ! សូមអបអរសាទរឆ្នាំថ្មីជាមួយគ្រួសាររបស់អ្នក។ សូមឲ្យឆ្នាំថ្មីនេះពោរពេញដោយសុខភាពល្អ សុភមង្គល និងភាពជោគជ័យ។ សូមអបអរសាទរឆ្នាំថ្មីខ្មែរជាមួយការទទួលខុសត្រូវ សុវត្តិភាពរាល់ការធ្វើដំណើរទៅស្រុកឬ ទៅណាមកណា។',
            sangkran: 'សង្រ្កាន (មកពីសំស្រ្កឹត «សង្ក្រាន្តិ») មានន័យថា ដំណើរឃ្លាតចាកទី, ការឈានចូលដល់, ឬដំណើរដែលព្រះអាទិត្យចរពីមីនរាសីចូលទៅមេសរាសី (ចុងឆ្នាំចាស់ផ្លាស់ចូលឆ្នាំថ្មី)។ វាសំដៅលើពិធីបុណ្យចូលឆ្នាំថ្មី (ជាទូទៅក្នុងខែមេសា) ដែលមានរយៈពេលបីថ្ងៃ។ សទិសន័យ ឬន័យប្រហាក់ប្រហែលរួមមាន បុណ្យចូលឆ្នាំថ្មី, មហាសង្រ្កាន, ឬការដាច់ឆ្នាំចាស់ផ្លាស់ចូលឆ្នាំថ្មី។',

    }),
    actions: {

    },
})