import { defineStore } from 'pinia'

import beatThePot from "../assets/beat-the-pot.jpg";
import squat from "../assets/squat.jpg";
import download from "../assets/download.jpg";

export const useHomeStore = defineStore('home', {
    state: () => ({
        welcomeMessage: 'តេជោសិទ្ធារាមមហាសង្រ្កានបាន្លួង',
        helperMessage: 'សួស្តីឆ្នាំថ្មីខ្មែរ! សូមអបអរសាទរឆ្នាំថ្មីជាមួយគ្រួសាររបស់អ្នក។ សូមឲ្យឆ្នាំថ្មីនេះពោរពេញដោយសុខភាពល្អ សុភមង្គល និងភាពជោគជ័យ។ សូមអបអរសាទរឆ្នាំថ្មីខ្មែរជាមួយការទទួលខុសត្រូវ សុវត្តិភាពរាល់ការធ្វើដំណើរទៅស្រុកឬ ទៅណាមកណា។',
        sangkran: 'សង្រ្កាន (មកពីសំស្រ្កឹត «សង្ក្រាន្តិ») មានន័យថា ដំណើរឃ្លាតចាកទី ការឈានចូលដល់ ឬដំណើរដែលព្រះអាទិត្យចរពីមីនរាសីចូលទៅមេសរាសី (ចុងឆ្នាំចាស់ផ្លាស់ចូលឆ្នាំថ្មី)។ វាសំដៅលើពិធីបុណ្យចូលឆ្នាំថ្មី (ជាទូទៅក្នុងខែមេសា) ដែលមានរយៈពេលបីថ្ងៃ។ សទិសន័យ ឬន័យប្រហាក់ប្រហែលរួមមាន បុណ្យចូលឆ្នាំថ្មី មហាសង្រ្កាន ឬការដាច់ឆ្នាំចាស់ផ្លាស់ចូលឆ្នាំថ្មី។',
        sangkran1: 'ទំនៀមពិធីចូលឆ្នាំប្រព្រឹត្តទៅចំនួន ៣ ថ្ងៃ។ ថ្ងៃដំបូងជាថ្ងៃមហាសង្ក្រាន្ត, ថ្ងៃទី ២ ជាថ្ងៃ វ័នបត, ថ្ងៃទី៣ ជាថ្ងៃឡើងស័ក។ រីឯការកំណត់ខែ ថ្ងៃ ម៉ោង នាទីដែលឆ្នាំចាស់ត្រូវផុតកំណត់ហើយទេព្តាឆ្នាំថ្មីត្រូវចុះមកទទួលតំ ណែងពីទេព្តាឆ្នាំចាស់នោះគេអាចដឹងបានដោយប្រើក្បួនហោរាសាស្ត្របុ រាណ គឺក្បួនមហាសសង្ក្រាន្ត ។',
        newsItems: [
            {
                id: 1,
                title: 'វាយក្អម',
                description: 'វាយក្អមគឺជាល្បែងប្រជាប្រិយខ្មែរ ដែលពេញនិយមលេងក្នុងឱកាសបុណ្យចូលឆ្នាំខ្មែរ។ កីឡាករត្រូវបានបិទភ្នែក ហើយប្រើដំបងវាយក្អមដែលផ្ទុករង្វាន់នៅខាងក្នុង។ ល្បែងនេះបង្កើតភាពសប្បាយរីករាយ និងសំណើចសម្រាប់អ្នកចូលរួម និងអ្នកទស្សនា។',
                date: '២០២៦-០៤-១៣',
                image: beatThePot
            },
            {
                id: 2,
                title: 'បោះអង្គុញ',
                description: 'បោះអង្គុញគឺជាល្បែងប្រជាប្រិយខ្មែរ ដែលលេងជាក្រុមក្នុងឱកាសបុណ្យចូលឆ្នាំខ្មែរ។ អ្នកលេងបែងចែកជាពីរក្រុម ហើយបោះអង្គុញទៅវិញទៅមក ដើម្បីវាយឲ្យប៉ះអង្គុញរបស់ក្រុមប្រឆាំង។ ល្បែងនេះបង្ហាញពីភាពរហ័សរហួន កម្លាំង និងភាពរួបរួមគ្នា។',
                date: '២០២៦-០៤-១៣',
                image: squat
            },
            {
                id: 3,
                title: 'ទាញព្រ័ត្រ',
                description: 'ទាញព្រ័ត្រគឺជាល្បែងប្រជាប្រិយដែលលេងជាក្រុម ដោយក្រុមពីរទាញខ្សែព្រ័ត្រប្រកួតគ្នា ដើម្បីឲ្យក្រុមរបស់ខ្លួនឈ្នះ។ ល្បែងនេះបង្ហាញពីកម្លាំង សាមគ្គីភាព និងការសហការរវាងសមាជិកក្នុងក្រុម។ វាជាល្បែងពេញនិយមក្នុងឱកាសបុណ្យចូលឆ្នាំខ្មែរ។',
                date: '២០២៦-០៤-១៣',
                image: download
            }],

    }),
    actions: {

    },
})